# DockablePane Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane Class
Members See Also
---
A user interface pane that participates in Revit's docking window system.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DockablePane : IDisposable
```

Visual Basic
---
```text
Public Class DockablePane _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DockablePane : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..DockablePane
# See Also
DockablePane Members
Autodesk.Revit.UI Namespace